
## Plan Result (prod/domain)

[CI link](https://github.com/tqer39/edu-quest/actions/runs/18633430402)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_dns_record.dev
  * google_project_service.domains
  * null_resource.wait_service_enable
  * module.domain_register_delegate.cloudflare_zone.root


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.dev will be created
  + resource "cloudflare_dns_record" "dev" {
      + comment             = "Dev environment subdomain"
      + comment_modified_on = (known after apply)
      + content             = "edu-quest-dev.pages.dev"
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "dev"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = (known after apply)
    }

  # google_project_service.domains will be created
  + resource "google_project_service" "domains" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "portfolio-391320"
      + service                    = "domains.googleapis.com"

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # null_resource.wait_service_enable will be created
  + resource "null_resource" "wait_service_enable" {
      + id = (known after apply)
    }

  # module.domain_register_delegate.cloudflare_zone.root will be created
  + resource "cloudflare_zone" "root" {
      + account               = {
          + id = "3c9a0adf6781e171e263a64f78c41ec4"
        }
      + activated_on          = (known after apply)
      + cname_suffix          = (known after apply)
      + created_on            = (known after apply)
      + development_mode      = (known after apply)
      + id                    = (known after apply)
      + meta                  = (known after apply)
      + modified_on           = (known after apply)
      + name                  = "edu-quest.app"
      + name_servers          = (known after apply)
      + original_dnshost      = (known after apply)
      + original_name_servers = (known after apply)
      + original_registrar    = (known after apply)
      + owner                 = (known after apply)
      + paused                = false
      + permissions           = (known after apply)
      + plan                  = (known after apply)
      + status                = (known after apply)
      + tenant                = (known after apply)
      + tenant_unit           = (known after apply)
      + type                  = "full"
      + vanity_name_servers   = (known after apply)
      + verification_key      = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudflare_nameservers  = (known after apply)
  + cloudflare_zone_id      = (known after apply)
  + dev_subdomain_record_id = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-prod","PRNumber":116,"Program":"tfcmt","SHA1":"c7b1771a70d39abd928c2a2763317211b2c8c502","Target":"prod/domain","Vars":{},"WorkflowName":"Terraform - prod"} -->